/**
 * พัดลมหมุนด้วยความเร็ว n รอบต่อวินาที เมื่อปิดสวิทช์จะทำให้ความเร็วของพัดลมลดลงเหลือเพียง 80 เปอร์เซ็นต์ทุกๆ สามวินาที 
 * และเมื่อความเร็วของพัดลมน้อยกว่า 0.5 รอบ/sec พัดลมจะหมุนได้อีก 1 รอบจึงหยุด จงเขียนโปรแกรมป้อนจำนวน n 
 * แล้วหาว่าพัดลมจะหยุดหมุนที่เวลาเท่าใด และพัดลมหมุนทั้งหมดกี่รอบ ดังตัวอย่างการทำงานของโปรแกรม
 * ------------------------------------------------------------------------------------------------
 * | n = 10                       | n = 20                        | n = 40                        |
 * | duration time = 42 seconds   | duration time  = 51 seconds   | duration time  = 60 seconds   |
 * | whirling about 144 rounds    | whirling about 294 rounds     | whirling about 594 rounds     |
 * ------------------------------------------------------------------------------------------------
 */

#include <stdio.h>

int main() {
    float n, spin = 0;
    int drt = 0;
    printf("n = ");
    scanf("%f", &n);

    for (n; n > 0.5; n *= 0.8)
    {   
        spin += n * 3;
        drt += 3;
    }
    spin += 1;

    printf("duration time = %d seconds\n", drt);
    printf("whirling about %.0f rounds", spin);
    
    return 0;
}